{
    "0": "🦠 Apple Apple scab 🚑: Treat with fungicides such as captan or mancozeb. Practice good sanitation by removing fallen leaves and fruit.\n\n🤔 Apple scab is a fungal disease that causes dark, scabby lesions on leaves, fruit, and twigs.",
    "1": "🦠 Apple Black rot 🚑: Prune and remove infected branches and fruit. Apply fungicides like captan or myclobutanil.\n\n🤔 Black rot is a fungal disease that affects the fruit, leaves, and bark of apple trees, causing dark, sunken lesions.",
    "2": "🦠 Apple Cedar apple rust 🚑: Apply fungicides such as myclobutanil. Remove nearby cedar trees if possible.\n\n🤔 Cedar apple rust is a fungal disease that requires both apple and cedar trees to complete its life cycle, causing yellow-orange spots on leaves and fruit.",
    "3": "🌱 Apple healthy 💚: This apple tree is healthy and shows no signs of disease. Maintain regular care and monitoring to ensure continued good health.\n\n🤔 This tree is currently free from any diseases and is in good health.",
    "4": "🌱 Blueberry healthy 💚: This blueberry plant is healthy and shows no signs of disease. Maintain regular care and monitoring to ensure continued good health.\n\n🤔 This plant is currently free from any diseases and is in good health.",
    "5": "🦠 Cherry (including sour) Powdery mildew 🚑: Apply fungicides like myclobutanil or sulfur. Ensure proper air circulation by pruning.\n\n🤔 Powdery mildew is a fungal disease that appears as white powdery spots on leaves and stems, affecting photosynthesis.",
    "6": "🌱 Cherry (including sour) healthy 💚: This cherry plant is healthy and shows no signs of disease. Maintain regular care and monitoring to ensure continued good health.\n\n🤔 This plant is currently free from any diseases and is in good health.",
    "7": "🦠 Corn (maize) Cercospora leaf spot Gray leaf spot 🚑: Use resistant varieties and apply fungicides such as strobilurins or triazoles.\n\n🤔 Cercospora leaf spot is a fungal disease that causes grayish spots on leaves, reducing photosynthesis and yield.",
    "8": "🦠 Corn (maize) Common rust 🚑: Apply fungicides like mancozeb or chlorothalonil. Plant resistant varieties and rotate crops.\n\n🤔 Common rust is a fungal disease that causes reddish-brown pustules on leaves, hindering the plant's ability to photosynthesize.",
    "9": "🦠 Corn (maize) Northern Leaf Blight 🚑: Use resistant varieties and apply fungicides such as azoxystrobin or propiconazole.\n\n🤔 Northern Leaf Blight is a fungal disease that creates long, grayish lesions on leaves, reducing the plant's photosynthetic capacity.",
    "10": "🌱 Corn (maize) healthy 💚: This corn plant is healthy and shows no signs of disease. Maintain regular care and monitoring to ensure continued good health.\n\n🤔 This plant is currently free from any diseases and is in good health.",
    "11": "🦠 Grape Black rot 🚑: Prune and remove infected leaves and fruit. Apply fungicides like myclobutanil or captan.\n\n🤔 Black rot is a fungal disease that causes black spots on leaves, stems, and fruit, leading to mummified berries.",
    "12": "🦠 Grape Esca (Black Measles) 🚑: Remove and destroy infected vines. Apply fungicides if available and ensure proper vineyard sanitation.\n\n🤔 Esca is a complex disease caused by multiple fungi, resulting in leaf stripe patterns and fruit rot.",
    "13": "🦠 Grape Leaf blight (Isariopsis Leaf Spot) 🚑: Apply fungicides like captan or mancozeb. Remove and destroy infected leaves.\n\n🤔 Leaf blight causes dark lesions on leaves and can lead to significant crop loss if not managed.",
    "14": "🌱 Grape healthy 💚: This grapevine is healthy and shows no signs of disease. Maintain regular care and monitoring to ensure continued good health.\n\n🤔 This plant is currently free from any diseases and is in good health.",
    "15": "🦠 Orange Haunglongbing (Citrus greening) 🚑: There is no cure. Remove and destroy infected trees to prevent spread. Control the Asian citrus psyllid vector.\n\n🤔 Citrus greening is a bacterial disease spread by insects, causing yellow shoots, leaf drop, and bitter fruit.",
    "16": "🦠 Peach Bacterial spot 🚑: Apply copper-based bactericides. Remove and destroy infected leaves and fruit. Plant resistant varieties.\n\n🤔 Bacterial spot causes water-soaked lesions on leaves and fruit, leading to significant crop loss.",
    "17": "🌱 Peach healthy 💚: This peach tree is healthy and shows no signs of disease. Maintain regular care and monitoring to ensure continued good health.\n\n🤔 This tree is currently free from any diseases and is in good health.",
    "18": "🦠 Pepper, bell Bacterial spot 🚑: Apply copper-based bactericides. Remove and destroy infected leaves and fruit. Use disease-free seeds.\n\n🤔 Bacterial spot in peppers causes dark, water-soaked spots on leaves and fruit, reducing yield.",
    "19": "🌱 Pepper, bell healthy 💚: This bell pepper plant is healthy and shows no signs of disease. Maintain regular care and monitoring to ensure continued good health.\n\n🤔 This plant is currently free from any diseases and is in good health.",
    "20": "🦠 Potato Early blight 🚑: Apply fungicides such as chlorothalonil or mancozeb. Use certified disease-free seed potatoes.\n\n🤔 Early blight causes dark, concentric lesions on leaves and tubers, leading to reduced yield and quality.",
    "21": "🦠 Potato Late blight 🚑: Apply fungicides like chlorothalonil or metalaxyl. Remove and destroy infected plants. Use resistant varieties.\n\n🤔 Late blight causes water-soaked lesions on leaves and stems, rapidly destroying the plant.",
    "22": "🌱 Potato healthy 💚: This potato plant is healthy and shows no signs of disease. Maintain regular care and monitoring to ensure continued good health.\n\n🤔 This plant is currently free from any diseases and is in good health.",
    "23": "🌱 Raspberry healthy 💚: This raspberry plant is healthy and shows no signs of disease. Maintain regular care and monitoring to ensure continued good health.\n\n🤔 This plant is currently free from any diseases and is in good health.",
    "24": "🌱 Soybean healthy 💚: This soybean plant is healthy and shows no signs of disease. Maintain regular care and monitoring to ensure continued good health.\n\n🤔 This plant is currently free from any diseases and is in good health.",
    "25": "🦠 Squash Powdery mildew 🚑: Apply fungicides like sulfur or potassium bicarbonate. Ensure good air circulation by spacing plants properly.\n\n🤔 Powdery mildew appears as white powdery spots on leaves and stems, reducing photosynthesis.",
    "26": "🦠 Strawberry Leaf scorch 🚑: Remove and destroy infected leaves. Apply fungicides such as captan or myclobutanil.\n\n🤔 Leaf scorch causes browning and drying of leaf edges, hindering the plant's growth.",
    "27": "🌱 Strawberry healthy 💚: This strawberry plant is healthy and shows no signs of disease. Maintain regular care and monitoring to ensure continued good health.\n\n🤔 This plant is currently free from any diseases and is in good health.",
    "28": "🦠 Tomato Bacterial spot 🚑: Apply copper-based bactericides. Remove and destroy infected leaves and fruit. Use disease-free seeds.\n\n🤔 Bacterial spot causes dark, water-soaked spots on leaves and fruit, leading to reduced yield.",
    "29": "🦠 Tomato Early blight 🚑: Apply fungicides like chlorothalonil or mancozeb. Remove and destroy infected leaves.\n\n🤔 Early blight causes dark, concentric lesions on leaves and stems, affecting the plant's health.",
    "30": "🦠 Tomato Late blight 🚑: Apply fungicides such as chlorothalonil or copper-based sprays. Remove and destroy infected plants.\n\n🤔 Late blight causes water-soaked lesions on leaves and stems, rapidly destroying the plant.",
    "31": "🦠 Tomato Leaf Mold 🚑: Apply fungicides like chlorothalonil or copper-based sprays. Ensure proper air circulation and avoid overhead watering.\n\n🤔 Leaf mold causes yellow spots on leaves and fuzzy growth on the underside, reducing photosynthesis.",
    "32": "🦠 Tomato Septoria leaf spot 🚑: Apply fungicides like chlorothalonil or copper-based sprays. Remove and destroy infected leaves.\n\n🤔 Septoria leaf spot causes circular spots with dark borders on leaves, leading to defoliation.",
    "33": "🦠 Tomato Spider mites Two-spotted spider mite 🚑: Apply miticides or insecticidal soap. Increase humidity and introduce beneficial insects like ladybugs.\n\n🤔 Spider mites cause stippling and yellowing of leaves, reducing the plant's vigor.",
    "34": "🦠 Tomato Target Spot 🚑: Apply fungicides such as chlorothalonil or copper-based sprays. Remove and destroy infected leaves.\n\n🤔 Target spot causes circular lesions with concentric rings on leaves and fruit, affecting the plant's health.",
    "35": "🦠 Tomato Tomato Yellow Leaf Curl Virus 🚑: Remove and destroy infected plants. Control whitefly populations that spread the virus.\n\n🤔 This virus causes yellowing and curling of leaves, stunting plant growth and reducing yield.",
    "36": "🦠 Tomato Tomato mosaic virus 🚑: Remove and destroy infected plants. Disinfect tools and avoid handling plants when wet.\n\n🤔 Tomato mosaic virus causes mottled leaves and stunted growth, affecting the plant's productivity.",
    "37": "🌱 Tomato healthy 💚: This tomato plant is healthy and shows no signs of disease. Maintain regular care and monitoring to ensure continued good health.\n\n🤔 This plant is currently free from any diseases and is in good health."
}