{
    "0": "Apple Apple scab: Treat with fungicides such as captan or mancozeb. Practice good sanitation by removing fallen leaves and fruit.",
    "1": "Apple Black rot: Prune and remove infected branches and fruit. Apply fungicides like captan or myclobutanil.",
    "2": "Apple Cedar apple rust: Apply fungicides such as myclobutanil. Remove nearby cedar trees if possible.",
    "3": "Apple healthy: This apple tree is healthy and shows no signs of disease. Maintain regular care and monitoring to ensure continued good health.",
    "4": "Blueberry healthy: This blueberry plant is healthy and shows no signs of disease. Maintain regular care and monitoring to ensure continued good health.",
    "5": "Cherry (including sour) Powdery mildew: Apply fungicides like myclobutanil or sulfur. Ensure proper air circulation by pruning.",
    "6": "Cherry (including sour) healthy: This cherry plant is healthy and shows no signs of disease. Maintain regular care and monitoring to ensure continued good health.",
    "7": "Corn (maize) Cercospora leaf spot Gray leaf spot: Use resistant varieties and apply fungicides such as strobilurins or triazoles.",
    "8": "Corn (maize) Common rust: Apply fungicides like mancozeb or chlorothalonil. Plant resistant varieties and rotate crops.",
    "9": "Corn (maize) Northern Leaf Blight: Use resistant varieties and apply fungicides such as azoxystrobin or propiconazole.",
    "10": "Corn (maize) healthy: This corn plant is healthy and shows no signs of disease. Maintain regular care and monitoring to ensure continued good health.",
    "11": "Grape Black rot: Prune and remove infected leaves and fruit. Apply fungicides like myclobutanil or captan.",
    "12": "Grape Esca (Black Measles): Remove and destroy infected vines. Apply fungicides if available and ensure proper vineyard sanitation.",
    "13": "Grape Leaf blight (Isariopsis Leaf Spot): Apply fungicides like captan or mancozeb. Remove and destroy infected leaves.",
    "14": "Grape healthy: This grapevine is healthy and shows no signs of disease. Maintain regular care and monitoring to ensure continued good health.",
    "15": "Orange Haunglongbing (Citrus greening): There is no cure. Remove and destroy infected trees to prevent spread. Control the Asian citrus psyllid vector.",
    "16": "Peach Bacterial spot: Apply copper-based bactericides. Remove and destroy infected leaves and fruit. Plant resistant varieties.",
    "17": "Peach healthy: This peach tree is healthy and shows no signs of disease. Maintain regular care and monitoring to ensure continued good health.",
    "18": "Pepper, bell Bacterial spot: Apply copper-based bactericides. Remove and destroy infected leaves and fruit. Use disease-free seeds.",
    "19": "Pepper, bell healthy: This bell pepper plant is healthy and shows no signs of disease. Maintain regular care and monitoring to ensure continued good health.",
    "20": "Potato Early blight: Apply fungicides such as chlorothalonil or mancozeb. Use certified disease-free seed potatoes.",
    "21": "Potato Late blight: Apply fungicides like chlorothalonil or metalaxyl. Remove and destroy infected plants. Use resistant varieties.",
    "22": "Potato healthy: This potato plant is healthy and shows no signs of disease. Maintain regular care and monitoring to ensure continued good health.",
    "23": "Raspberry healthy: This raspberry plant is healthy and shows no signs of disease. Maintain regular care and monitoring to ensure continued good health.",
    "24": "Soybean healthy: This soybean plant is healthy and shows no signs of disease. Maintain regular care and monitoring to ensure continued good health.",
    "25": "Squash Powdery mildew: Apply fungicides like sulfur or potassium bicarbonate. Ensure good air circulation by spacing plants properly.",
    "26": "Strawberry Leaf scorch: Remove and destroy infected leaves. Apply fungicides such as captan or myclobutanil.",
    "27": "Strawberry healthy: This strawberry plant is healthy and shows no signs of disease. Maintain regular care and monitoring to ensure continued good health.",
    "28": "Tomato Bacterial spot: Apply copper-based bactericides. Remove and destroy infected leaves and fruit. Use disease-free seeds.",
    "29": "Tomato Early blight: Apply fungicides like chlorothalonil or mancozeb. Remove and destroy infected leaves.",
    "30": "Tomato Late blight: Apply fungicides such as chlorothalonil or copper-based sprays. Remove and destroy infected plants.",
    "31": "Tomato Leaf Mold: Apply fungicides like chlorothalonil or copper-based sprays. Ensure proper air circulation and avoid overhead watering.",
    "32": "Tomato Septoria leaf spot: Apply fungicides like chlorothalonil or copper-based sprays. Remove and destroy infected leaves.",
    "33": "Tomato Spider mites Two-spotted spider mite: Apply miticides or insecticidal soap. Increase humidity and introduce beneficial insects like ladybugs.",
    "34": "Tomato Target Spot: Apply fungicides such as chlorothalonil or copper-based sprays. Remove and destroy infected leaves.",
    "35": "Tomato Tomato Yellow Leaf Curl Virus: Remove and destroy infected plants. Control whitefly populations that spread the virus.",
    "36": "Tomato Tomato mosaic virus: Remove and destroy infected plants. Disinfect tools and avoid handling plants when wet.",
    "37": "Tomato healthy: This tomato plant is healthy and shows no signs of disease. Maintain regular care and monitoring to ensure continued good health."
}